Revit 2027 API
Alignment.Description Property
 The Description of this alignment.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
public:
property String^ Description {
	String^ get ();
}
member Description : string with get
Property Value
String
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace